//商铺分类
var stuff_code_shop = [
	['1', '黑色及有色金属'],
	['2', '橡胶、塑料及非金属'],
	['3', '五金制品'],
	['4', '水泥、砖瓦灰砂石及混凝土制品'],
	['5', '木、竹材及其制品'],
	['6', '玻璃、陶瓷及面砖'],
	['7', '装饰石材及地板'],
	['8', '墙面、天棚装饰及屋面材料'],
	['9', '门窗及门窗五金'],
	['10','装饰线条、装饰件、栏杆、扶手及其它'],
	['11','涂料及防腐防水材料'],
	['12','油品、化工原料及胶粘材料'],
	['13','绝热、耐火材料'],
	['14', '管材'],
	['15', '管件'],
	['16', '阀门'],
	['17', '法兰'],
	['18', '洁具'],
	['19', '水暖及通风空调器材'],
	['20', '消防器材'],
	['21', '仪表'],
	['22', '灯具、灯源'],
	['23', '开关'],
	['24', '保险、绝缘材料'],
	['25', '电线电缆及光纤光缆'],
	['26', '电气线路敷设材料'],
	['27', '弱电及信息类器材'],
	['28', '仿古建筑材料'],
	['29', '园林绿化'],
	['30', '成型构件及加工件'],
	['31', '密封、电极及劳保用品等其他材料'],
	['32', '周转材料及工器具'],
	['33', '道路桥梁专用材料'],
	['50', '通风空调设备'],
	['51', '泵、供水设备'],
	['52', '热水、采暖锅炉设备'],
	['53', '水处理及环保设备'],
	['54', '厨房设备'],
	['55', '电气设备及附件'],
	['56', '电梯'],
	['57', '安防及建筑智能化设备'],
	['58' ,'体育休闲设施'],
	['80', '砼、砂浆及其配合比材料'],
	['98', '工程检测仪器仪表'],
	['99', '工程费用台班'],
	['100','家具']
];

//根据名称取得编码
function getStuffCodeByName(name){
    if (!name) {
        return "";
    }else {
		if(name == "其他"){
			return "0";
		}
        var sName = "";
        name = name.replace(/[\s]/g, "");
        for (var i in stuff_code_shop) {
            if (name == stuff_code_shop[i][1]) {
                return stuff_code_shop[i][0];
            }
        }
    }
}
//根据编码得到名称
function getStuffName(v){
	if(!v)
	  return "";
	var stuffname="";
	v=v.replace(/[\s]/g,"");
	for(var i in stuff_code_shop){
		if(v == stuff_code_shop[i][0])
			return stuff_code_shop[i][1];
	}
	return "未分类";
};
