var stuff_code = [
	['1', '01黑色及有色金属'],
	['2', '02橡胶、塑料及非金属'],
	['3', '03五金制品'],
	['4', '04水泥、砖瓦灰砂石及混凝土制品'],
	['5', '05木、竹材及其制品'],
	['6', '06玻璃、陶瓷及面砖'],
	['7', '07装饰石材及地板'],
	['8', '08墙面、天棚装饰及屋面材料'],
	['9', '09门窗制品及门窗五金'],
	['10', '10装饰线条、装饰件、栏杆、扶手及其它'],
	['11', '11涂料及防腐防水材料'],
	['12', '12油品、化工原料及胶粘材料'],
	['13', '13绝热、耐火材料'],
	['14', '14管材'],
	['15', '15管件'],
	['16', '16阀门'],
	['17', '17法兰及其垫片'],
	['18', '18洁具及燃气器具'],
	['19', '19水暖及通风空调器材'],
	['20', '20消防器材'],
	['21', '21仪表及自动化控制'],
	['22', '22灯具、光源'],
	['23', '23开关、插座'],
	['24', '24保险、绝缘材料'],
	['25', '25电线电缆及光纤光缆'],
	['26', '26电气线路敷设材料'],
	['27', '27弱电及信息类器材'],
	['28', '28仿古建筑材料'],
	['29', '29园林绿化'],
	['30', '30成型构件及加工件'],
	['31', '31密封、电极及劳保用品等其它材料'],
	['32', '32周转材料及工器具'],
	['33', '33道路桥梁专用材料'],
	['50', '50通风空调设备'],
	['51', '51泵、供水设备'],
	['52', '52热水、采暖锅炉设备'],
	['53', '53水处理及环保设备'],
	['54', '54厨房设备'],
	['55', '55电气设备及附件'],
	['56', '56电梯'],
	['57', '57安防及建筑智能化设备'],
	['58' ,'58体育休闲设施'],
	['80', '80混凝土、砂浆及其它配合比材'],
	['98', '98工程检测仪器仪表'],
	['99', '99工程费用台班']
];

//根据名称取得编码
function getStuffCodeByName(name){
    if (!name) {
        return "";
    }else {
		if(name == "其他"){
			return "0";
		}
        var sName = "";
        name = name.replace(/[\s]/g, "");
        for (var i in stuff_code_shop) {
            if (name == stuff_code_shop[i][1]) {
                return stuff_code_shop[i][0];
            }
        }
    }
}
//根据编码得到名称
function getStuffName(v){
	if(!v)
	  return "";
	var stuffname="";
	v=v.replace(/[\s]/g,"");
	for(var i in stuff_code){
		if(v == stuff_code[i][0])
			return stuff_code[i][1];
	}
	return "未分类";
};