var zhcn_pro_db = ["广东","广西","北京","上海","重庆","黑龙江","四川","湖南","海南","贵州","湖北","江西","天津","山东","山西","江苏","宁夏","河北","河南","内蒙古","福建","云南","浙江","甘肃","辽宁"];
var zhcn_city_db = {
"广东" : ["广州市","韶关市","深圳市","珠海市","汕头市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市","顺德市"],
"广西" : ["南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"],
"北京" : ["北京市"],
"上海" : ["上海市"],
"重庆" : ["重庆市"],
"黑龙江" : ["哈尔滨市","双鸭山市","大庆市","伊春市","齐齐哈尔市","牡丹江市","黑河市","佳木斯市","大兴安岭","绥化市","鹤岗市","七台河市","农垦总局","鸡西市"],
"四川" : ["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","宜宾市","广安市","达州市","巴中市","雅安市","眉山市","资阳市","阿坝州","甘孜州","凉山州"],
"湖南" : ["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","郴州市","益阳市","永州市","怀化市","娄底市","吉首市"],
"海南" : ["万宁市","文昌市","五指山市","儋州市","东方市","海口市","琼海市","三亚市","白沙县","保亭县","昌江县","澄迈县","定安县","乐东县","临高县","陵水县","琼中县","屯昌县"],
"贵州" : ["贵阳市","遵义市","铜仁市","毕节市","黔西州","黔东州","黔南州","安顺市","六盘水市"],
"湖北" : ["武汉市","黄石市","襄樊市","荆州市","宜昌市","黄冈市","鄂州市","十堰市","孝感市","荆门市","咸宁市","随州市","恩施市","神农架市"],
"江西" : ["南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"],
"天津" : ["天津市"],
"山东" : ["济南市","青岛市"],
"山西" : ["太原市"],
"江苏" : ["南京市"],
"宁夏" : ["银川市","吴忠市","石嘴山市","固原市","中卫市"],
"河北" : ["石家庄市","唐山市","秦皇岛市","邯郸市","刑台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"],
"河南" : ["郑州市"],
"内蒙古" : ["呼和浩特市"],
"福建" : ["厦门市"],
"云南" : ["昆明市","曲靖市","普洱市","临沧市","丽江市","保山市","玉溪市","昭通市","大理州","楚雄州","红河州","文山州","版纳州","德宏州","迪庆州","怒江州"],
"浙江" : ["杭州市"],
"甘肃" : ["兰州市","白银市","酒泉市","陇南市"],
"辽宁" : ["大连市"]
};
var zhcn_area_db={
//广东
"广州市" : ["广州市","从化市","增城市","花都区"],
"韶关市" : ["韶关市","乐昌市","南雄市","曲江县","仁化县","乳源","始兴县","翁源县","新丰县"],
"深圳市" : ["深圳市"],
"珠海市" : ["珠海市"],
"汕头市" : ["汕头市","潮阳市","澄海区","南澳县","潮南区","濠江区"],
"佛山市" : ["佛山市","南海市"],
"江门市" : ["江门市","恩平市","鹤山市","开平市","台山市","新会区"],
"湛江市" : ["湛江市","雷州市","廉江市","遂溪县","吴川市","徐闻县"],
"茂名市" : ["茂名市","电白市","高州市","化州市","信宜市"],
"肇庆市" : ["肇庆市","德庆县","封开县","高要市","广宁县","怀集县","四会市","鼎湖区"],
"惠州市" : ["惠州市","博罗县","惠东县","惠阳市","龙门县"],
"梅州市" : ["梅州市","大埔县","丰顺县","蕉岭县","梅县","平远县","五华县","兴宁市"],
"汕尾市" : ["汕尾市","海丰县","陆丰市","陆河县"],
"河源市" : ["河源市","东源县","和平县","连平县","龙川县","紫金县"],
"阳江市" : ["阳江市","阳春市","阳东县","阳西县","海陵岛区"],
"清远市" : ["清远市","佛冈县","连南县","连山县","连州市","清新县","阳山县","英德市"],
"东莞市" : ["东莞市"],
"中山市" : ["中山市"],
"潮州市" : ["潮州市","潮安县","饶平县"],
"揭阳市" : ["揭阳市","惠来县","揭东县","揭西县","普宁市"],
"云浮市" : ["云浮市","罗定市","新兴县","郁南县","云安县"],
"顺德市" : ["顺德市"],

//广西
"南宁市" : ["南宁市","宾阳县","横县","隆安县","马山县","上林县","武鸣县","邕宁县"],
"柳州市" : ["柳州市","柳城县","柳江县","鹿寨县","融安县","融水县","三江县"],
"桂林市" : ["桂林市","恭城县","灌阳县","荔浦县","临桂县","灵川县","龙胜县","平乐县","全州县","兴安县","阳朔县","永福县","资源县"],
"梧州市" : ["梧州市","苍梧县","蒙山县","藤县","岑溪市"],
"北海市" : ["北海市","合浦县"],
"防城港市" : ["防城港市","东兴市","上思县","港口区","防城区"],
"钦州市" : ["钦州市","灵山县","浦北县","钦州港区"],
"贵港市" : ["贵港市","桂平市","平南县"],
"玉林市" : ["玉林市","北流县","博白县","陆川县","容县","兴业县"],
"百色市" : ["百色市","德保县","靖西县","乐业县","凌云县","隆林县","那坡县","平果县","田东县","田林县","田阳县","西林县"],
"贺州市" : ["贺州市","富川县","昭平县","钟山县"],
"河池市" : ["河池市","巴马县","大化县","东兰县","都安县","凤山县","环江县","罗城县","南丹县","天峨县","宜州市"],
"来宾市" : ["来宾市","合山市","金秀县","武宣县","象州县","忻城县"],
"崇左市" : ["崇左市","大新县","扶绥县","龙州县","宁明县","凭祥市","天等县"],

//北京
"北京市" : ["北京市"],

//上海
"上海市" : ["上海市"],

//重庆
"重庆市" : ["重庆市","渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","万州区","涪陵区","黔江区","长寿区","江津区","合川区","永川区","南川区","綦江县","潼南县","铜梁县","大足县","荣昌县","璧山县","梁平县","城口县","丰都县","垫江县","武隆县","云阳县","奉节县","巫山县","巫溪县","石柱县","秀山县","酉阳县","彭水县","忠县","开县"],

//黑龙江
"哈尔滨市" : ["哈尔滨市","尚志市","宾县","延寿县","依兰县","方正县"],
"双鸭山市" : ["双鸭山市"],
"大庆市" : ["大庆市"],
"伊春市" : ["伊春市","铁力市","嘉荫县"],
"齐齐哈尔市" : ["齐齐哈尔市","碾子山区","讷河市","龙江县","依安县","泰来县","富裕县","克山县","克东县","甘南县","拜泉县"],
"牡丹江市" : ["牡丹江市"],
"黑河市" : ["黑河市"],
"佳木斯市" : ["佳木斯市","富锦市","桦南县","同江市"],
"大兴安岭" : ["大兴安岭","加格达奇区","松岭区","新林区","呼中区","呼玛县","塔河县","漠河县"],
"绥化市" : ["绥化市","安达市","海伦市","肇东市","明水县","青冈县","望奎县","绥棱县","兰西县","庆安县"],
"鹤岗市" : ["鹤岗市"],
"七台河市" : ["七台河市"],
"农垦总局" : ["哈尔滨分局","宝泉岭分局","牡丹江分局","建三江分局","齐齐哈尔分局","红兴隆分局","北安分局","九三分局","绥化分局"],
"鸡西市" : ["鸡西市"],

//四川
"成都市" : ["成都市","龙泉驿区","青白江区","新都区","温江区","双流县","郫县","都江堰市","崇州市","邛崃市","彭州市","金堂县","大邑县","蒲江县","新津县"],
"自贡市" : ["自贡市"],
"攀枝花市" : ["攀枝花市","米易县"],
"泸州市" : ["泸州市","泸县","合江县","古蔺县","叙永县"],
"德阳市" : ["德阳市","旌阳区","广汉市","什邡市","绵竹市","中江县","罗江县"],
"绵阳市" : ["绵阳市","江油市","平武县","安县","梓潼县","北川县","盐亭县","三台县"],
"广元市" : ["广元市","青川县","苍溪县","剑阁县","旺苍县"],
"遂宁市" : ["遂宁市","安居区","蓬溪县","射洪县","大英县"],
"内江市" : ["内江市","资中县","威远县","隆昌县"],
"乐山市" : ["乐山市","峨眉山市","犍为县"],
"南充市" : ["南充市","顺庆区","高坪区","嘉陵区","阆中市","南部县","西充县","营山县","蓬安县","仪陇县"],
"宜宾市" : ["宜宾市","南溪县","江安县","长宁县","高县","筠连县","珙县","兴文县","屏山县","屏山新城县"],
"广安市" : ["广安市","华蓥县","岳池县","武胜县","邻水县"],
"达州市" : ["达州市","通川区","万源市","宣汉县","开江县","大竹县","渠县"],
"巴中市" : ["巴中市","平昌县","通江县","南江县"],
"雅安市" : ["雅安市","名山县"],
"眉山市" : ["眉山市","仁寿县","彭山县","洪雅县","丹棱县","青神县","眉山县","东坡区"],
"资阳市" : ["资阳市","简阳市","乐至县","安岳县"],
"阿坝州" : ["阿坝州","金川县","小金县","黑水县","汶川县","理县","茂县","松潘县","九寨沟县","马尔康县","阿坝县","红原县","壤塘县","若尔盖县"],
"甘孜州" : ["甘孜州","康定县","泸定县","丹巴县","九龙县","雅江县","道孚县","新龙县","理塘县"],
"凉山州" : ["凉山州","西昌市","会理县","会东县","普格县","宁南县","德昌县","冕宁县","盐源县","木里县","昭觉县","金阳县","布拖县","美姑县","雷波县","越西县","喜德县","甘洛县"],

//湖南
"长沙市" : ["长沙市"],
"株洲市" : ["株洲市"],
"湘潭市" : ["湘潭市"],
"衡阳市" : ["衡阳市"],
"邵阳市" : ["邵阳市"],
"岳阳市" : ["岳阳市"],
"常德市" : ["常德市"],
"张家界市" : ["张家界市","慈利县","桑植县","武陵源区","永定区"],
"郴州市" : ["郴州市","临武县","汝城县"],
"益阳市" : ["益阳市"],
"永州市" : ["永州市","宁远县","道县","东安县","江华县","江永县","蓝山县","祁阳县","双牌县","新田县"],
"怀化市" : ["怀化市"],
"娄底市" : ["娄底市"],
"吉首市" : ["吉首市"],

//海南
"万宁市" : ["万宁市"],
"文昌市" : ["文昌市"],
"五指山市" : ["五指山市"],
"儋州市" : ["儋州市"],
"东方市" : ["东方市"],
"海口市" : ["海口市"],
"琼海市" : ["琼海市"],
"三亚市" : ["三亚市"],
"白沙县" : ["白沙县"],
"保亭县" : ["保亭县"],
"昌江县" : ["昌江县"],
"澄迈县" : ["澄迈县"],
"定安县" : ["定安县"],
"乐东县" : ["乐东县"],
"临高县" : ["临高县"],
"陵水县" : ["陵水县"],
"琼中县" : ["琼中县"],
"屯昌县" : ["屯昌县"],

//贵州
"贵阳市" : ["贵阳市"],
"遵义市" : ["遵义市"],
"铜仁市" : ["铜仁市"],
"毕节市" : ["毕节市"],
"黔西州" : ["兴义市"],
"黔东州" : ["凯里市"],
"黔南州" : ["都匀市"],
"安顺市" : ["安顺市"],
"六盘水市" : ["六盘水市","六枝特区"],

//湖北
"武汉市" : ["武汉市"],
"黄石市" : ["黄石市"],
"襄樊市" : ["襄樊市"],
"荆州市" : ["荆州市"],
"宜昌市" : ["宜昌市"],
"黄冈市" : ["黄冈市"],
"鄂州市" : ["鄂州市"],
"十堰市" : ["十堰市"],
"孝感市" : ["孝感市"],
"荆门市" : ["荆门市"],
"咸宁市" : ["咸宁市"],
"随州市" : ["随州市"],
"恩施市" : ["恩施市"],
"神农架市" : ["神农架市"],

//江西
"南昌市" : ["南昌市"],
"景德镇市" : ["景德镇市","乐平市"],
"萍乡市" : ["萍乡市","萍乡县","湘东区","莲花县","上栗县","芦溪县"],
"九江市" : ["九江市","庐山区","九江县","武宁县","修水县","永修县","德安县","都昌县","星子县","湖口县","彭泽县","瑞昌县","共青城"],
"新余市" : ["新余市","分宜县"],
"鹰潭市" : ["鹰潭市"],
"赣州市" : ["赣州市"],
"吉安市" : ["吉安市"],
"宜春市" : ["宜春市","丰城市","樟树市","高安市","奉新县","万载县","上高县","宜丰县","靖安县","铜鼓县"],
"抚州市" : ["抚州市","南城县","黎川县","南丰县","崇仁县","乐安县","宜黄县","金溪县","资溪县","东乡县","广昌县"],
"上饶市" : ["上饶市","德兴市","上饶县","广丰县","玉山县","铅山县","横峰县","弋阳县","余干县","万年县","婺源县","波阳县","三清山"],

//天津
"天津市" : ["天津市"],

//山东
"济南市" : ["济南市","长清区","济阳县","平阴县","商河县","章丘市"],
"青岛市" : ["青岛市","黄岛区","城阳区","胶州市","即墨市","平度市","胶南市","莱西市"],

//山西
"太原市" : ["太原市","清徐县","古交市","阳曲县"],

//江苏
"南京市" : ["南京市","浦口区","江宁区","六合区","溧水县","高淳县"],

//宁夏
"银川市" : ["银川市","灵武市"],
"吴忠市" : ["吴忠市","红寺堡区","盐池县","同心县","青铜峡市"],
"石嘴山市" : ["石嘴山市"],
"固原市" : ["固原市"],
"中卫市" : ["中卫市","海原县","中宁县"],

//河北
"石家庄市" : ["石家庄市"],
"唐山市" : ["唐山市"],
"秦皇岛市" : ["秦皇岛市"],
"邯郸市" : ["邯郸市"],
"刑台市" : ["刑台市"],
"保定市" : ["保定市"],
"张家口市" : ["张家口市"],
"承德市" : ["承德市"],
"沧州市" : ["沧州市"],
"廊坊市" : ["廊坊市"],
"衡水市" : ["衡水市"],

//河南
"郑州市" : ["郑州市"],

//内蒙古
"呼和浩特市" : ["呼和浩特市","土默特左旗","托克托县","和林格尔县","武川县","清水河县"],

//福建
"厦门市" : ["厦门市","集美区","同安区","翔安区","海沧区","鼓浪屿岛等岛屿"],

//云南
"昆明市" : ["昆明市","呈贡新城"],
"曲靖市" : ["曲靖市","麒麟区"],
"普洱市" : ["普洱市","思茅区"],
"临沧市" : ["临沧市","临翔区"],
"丽江市" : ["丽江市","玉龙县"],
"保山市" : ["保山市","隆阳区"],
"玉溪市" : ["玉溪市","红塔区"],
"昭通市" : ["昭通市","昭阳区"],
"大理州" : ["大理州"],
"楚雄州" : ["楚雄州"],
"红河州" : ["红河州","蒙自县"],
"文山州" : ["文山州","文山县"],
"版纳州" : ["版纳州","景洪市"],
"德宏州" : ["德宏州","潞西市"],
"迪庆州" : ["迪庆州","香格里拉县"],
"怒江州" : ["怒江州","六库镇"],

//浙江
"杭州市" : ["杭州市"],

//甘肃
"兰州市" : ["兰州市"],
"白银市" : ["白银市"],
"酒泉市" : ["酒泉市"],
"陇南市" : ["陇南市"],

//辽宁
"大连市" : ["大连市"]
}; 