/*
 * 商铺分类
 * 1：重点分类 0：普通分类
 * 所有标点符号请使用英文半角输入
 */
 var shop_db={
 	"土建":[["1","钢材"],["0","铝材"],["1","水泥制品"],["1","商品混凝土"],["0","砖瓦灰沙石"],["1","机械设备"],["0","钢结构"],["0","周转材料"],["0","辅材"],["0","其他"]],
 	"装饰":[["1","装饰石材"],["1","陶瓷"],["1","玻璃"],["0","家具"],["1","天花墙板"],["1","竹木"],["0","五金制品"],["0","织物线条"],["0","塑料"],["1","油漆涂料"],["1","门窗"],["0","其他"]],
 	"安装":[["1","电线电缆"],["1","配电装置"],["1","电气设备"],["1","管材管件"],["0","通风空调"],["1","卫生洁具"],["0","保温吸声"],["0","防火"],["0","防水"],["1","照明"],["0","自动化控制"],["0","水处理"],["1","消防"],["0","智能化"],["1","阀门"],["0","电梯"],["0","焊接材料"],["0","运动器材"],["0","其他"]],
 	"市政":[["0","市政构建"],["0","道路交通"],["0","其他"]],
 	"园林":[["0","仿古"],["1","园林苗木"]]//最后一项请勿添加逗号
 };
  var shop_db1={
 	"土建":[
			["1","黑色及有色金属"],
			["0","水泥、砖瓦灰砂石及混凝土制品"],
			["1","砼、砂浆及其配合比材料"],
			["1","周转材料及工器具"],
			["0","密封、电极及劳保用品等其他材料"],
			["0","其他"]
		   ],
 	"装饰":[
			["1","装饰石材及地板"],
			["1","玻璃、陶瓷及面砖"],
			["1","墙面、天棚装饰及屋面材料"],
			["0","木、竹材及其制品"],
			["1","家具"],
			["1","五金制品"],
			["0","装饰线条、装饰件、栏杆、扶手及其它"],
			["0","橡胶、塑料及非金属"],
			["0","涂料及防腐防水材料"],
			["1","门窗制品及门窗五金"],
			["1","油品、化工原料及胶粘材料"],
			["0","其他"]
		   ],
 	"安装":[
			["1","电线电缆及光纤光缆"],
			["1","开关"],
			["1","电气设备及附件"],
			["1","通风空调设备"],
			["0","灯具"],
			["1","仪表"],
			["0","安防及建筑智能化设备"],
			["0","电梯"],
			["0","电气线路敷设材料"],
			["1","弱电及信息类器材"],
			["0","管材"],
			["0","管件"],
			["1","法兰"],
			["0","洁具"],
			["1","阀门"],
			["0","绝热、耐火材料"],
			["0","水处理及环保设备"],
			["0","消防"],
			["0","泵、供水设备"],
			["0","厨房设备"],
			["0","水暖及通风空调器材"],
			["0","热水、采暖锅炉设备"],
			["0","保险、绝缘材料"],
			["0","体育休闲设施"],
			["0","其他"]
		   ],
 	"市政园林":[
				["0","成型构件及加工件"],
				["0","道路桥梁专用材料"],
				["0","仿古建筑材料"],
				["0","园林绿化"],
				["0","工程费用台班"],
				["0","工程检测仪器仪表"],
				["0","其他"]
			  ]
 };
 
//ext-store-data用到(包括所有) 数据格式['value','text','style']
function getAllShop_db(){
	var cname = [];
	cname.push(['', '所有', '']);
	for(var c in shop_db1){
		var parent = ['/' + c + '/', " ├ " + c, 'display:none'];
		cname.push(parent);
		for(var z = 0; z < shop_db1[c].length; z++){
			var son;
			//重点分类字体颜色为红色
			if(shop_db1[c][z][0] == "1"){
				son = ['/' + c + '/' + shop_db1[c][z][1] + '/', " │  ├ " + shop_db1[c][z][1], 'color:red'];
			}
			else{
				son = ['/' + c + '/' + shop_db1[c][z][1] + '/', " │  ├ " + shop_db1[c][z][1], ''];
			}
			cname.push(son);
		}
	}
	return cname;
}; 
//ext-store-data用到(不包括所有) 数据格式['value','text','style']
function getShop_db(){
	var cname = [];
	for(var c in shop_db1){
		var parent = ['/' + c + '/', " ├ " + c, 'display:none'];
		cname.push(parent);
		for(var z = 0; z < shop_db1[c].length; z++){
			var son;
			//重点分类字体颜色为红色
			if(shop_db1[c][z][0] == "1"){
				son = ['/' + c + '/' + shop_db1[c][z][1] + '/', " │  ├ " + shop_db1[c][z][1], 'color:red'];
			}
			else{
				son = ['/' + c + '/' + shop_db1[c][z][1] + '/', " │  ├ " + shop_db1[c][z][1], ''];
			}
			cname.push(son);
		}
	}
	return cname;
};