/*
 * 建材分类 
 * 所有标点符号请使用英文半角输入,各一级分类以逗号分隔，最后一个分类后不加任何符号 例如："黑色及有色金属":["xx","xx"],"水暖及通风空调器材":["xx","xx"]
 * 
 * "黑色及有色金属":["xx","xx"]与"水暖及通风空调器材":["xx","xx"]之间 和 "xx","xx"之间必须加逗号
 */

var stuff_cid = {
	// part1
		"黑色及有色金属" : [["黑色金属", "0100"], ["钢筋", "0101"], ["钢丝", "0103"], ["钢丝绳", "0105"], ["钢绞线、钢丝束", "0107"], ["圆钢", "0109"], ["方钢", "0111"], ["扁钢", "0113"], ["六角钢", "0115"],
			["工字钢", "0117"], ["槽钢", "0119"], ["角钢", "0121"], ["H型钢", "0123"], ["其它型钢", "0127"], ["钢板", "0129"], ["钢带", "0131"], ["钢轨及钢轨配件", "0135"], ["铜板材", "0137"],
			["铜棒材", "0141"], ["铜线材", "0143"], ["铝板（带）材", "0145"], ["铝棒材", "0147"], ["铝线材", "0149"], ["铝型材", "0151"], ["铝合金建筑型材", "0153"], ["铅材", "0155"], ["锌材", "0161"],
			["其它金属", "0163"], ["金属材料", "0165"], ["加工件", "0167"]],
	
	"橡胶、塑料及非金属" : [["橡胶", "0200"], ["橡胶板", "0201"], ["橡胶条/带", "0203"], ["橡胶圈", "0205"], ["其它橡胶材料", "0207"], ["塑料薄膜、布", "0209"], ["塑料板", "0211"], ["塑料带", "0213"], ["塑料棒", "0215"], ["有机玻璃", "0217"],
			["其它塑料材料", "0219"], ["石墨碳素制品", "0223"], ["玻璃钢", "0225"], ["棉毛及其制品", "0227"], ["丝麻及其制品", "0229"], ["化纤及其制品", "0231"], ["草及其制品", "0233"], ["其它非金属材料", "0235"]],
	
	"五金制品" : [["铆钉", "0301"], ["螺钉", "0303"], ["螺栓", "0305"], ["膨胀螺栓", "0307"], ["螺母", "0309"], ["螺柱", "0311"], ["垫圈", "0313"], ["挡圈", "0315"], ["销", "0317"], ["键", "0319"], ["砂轮", "0321"], ["磨头", "0323"], ["涂附磨具与磨料", "0327"], ["焊条", "0341"], ["焊丝", "0343"],
			  ["焊剂、焊粉", "0345"], ["钎料及钎剂", "0347"], ["普通钉类", "0351"], ["轴承", "0353"], ["网、丝布", "0355"], ["铁丝", "0357"], ["铁件", "0359"], ["钢筋接头、锚具及钢筋保护帽", "0361"], ["小五金", "0363"], ["低值易耗品", "0365"], ["其它五金件", "0367"]],

	"水泥、砖瓦灰砂石及混凝土制品" : [["水泥", "0401"], ["砂", "0403"], ["石子", "0405"], ["轻骨料", "0407"], ["灰、粉、土等掺合填充料", "0409"], ["石料", "0411"], ["砌砖", "0413"], ["砌块", "0415"],
			["瓦", "0417"], ["混凝土、砂浆外加剂", "0423"], ["混凝土构件", "0424"], ["水泥及混凝土预制品", "0427"], ["钢筋混凝土预制品", "0429"]],

	"木、竹材及其制品" : [["原木", "0501"], ["锯材", "0503"], ["胶合板", "0505"], ["纤维板", "0507"], ["细木工板", "0509"], ["空心木板", "0511"], ["刨花板", "0513"], ["其它人造木板", "0519"], ["木制容器类", "0521"],
			["木制台类及货架", "0523"], ["其它木制品", "0525"], ["竹材", "0531"], ["竹板", "0533"], ["竹制品", "0535"]],

	"玻璃、陶瓷及面砖" : [["平板玻璃", "0601"], ["彩色玻璃", "0603"], ["钢化玻璃", "0605"], ["夹丝玻璃", "0607"], ["夹层玻璃", "0609"], ["中空玻璃", "0611"], ["镀膜玻璃", "0621"], ["工艺装饰玻璃", "0625"], ["镭射玻璃", "0641"],
			["特种玻璃", "0642"], ["其它玻璃", "0643"], ["玻璃砖", "0651"], ["玻璃马赛克", "0653"], ["玻璃镜", "0655"], ["玻璃制品", "0657"], ["陶瓷内墙砖", "0661"], ["陶瓷外墙砖", "0662"], ["陶瓷地砖", "0665"], ["陶瓷马赛克", "0667"], ["其它陶瓷制品", "0670"]],

	"装饰石材及地板" : [["装饰石材及地板", "0700"], ["天然石板材", "0701"], ["人造石板材", "0703"], ["微晶玻璃板", "0705"], ["水磨石板", "0707"], ["文化石及麻石材", "0709"], ["其它装饰石材", "0711"], ["石材制品", "0713"], ["石材装饰零星制品", "0715"], ["石材装饰辅助用料", "0723"],
			["实木地板", "0741"], ["软木地板", "0743"], ["竹地板", "0745"], ["塑料地板", "0747"], ["橡胶地板", "0749"], ["复合地板", "0751"], ["活动地板", "0753"], ["其它地板", "0755"]],

	"墙面、天棚装饰及屋面材料" : [["石膏装饰板", "0801"], ["竹木装饰板", "0803"], ["金属装饰板", "0805"], ["矿物棉装饰板", "0807"], ["塑料装饰板", "0809"], ["复合装饰板", "0811"], ["铝塑复合板", "0812"], ["纤维水泥装饰板", "0813"], ["珍珠岩装饰板", "0815"],
			["硅酸钙装饰板", "0817"], ["其它装饰板", "0819"], ["轻质复合墙板、屋面板", "0821"], ["网格布/带", "0823"], ["轻钢龙骨", "0831"], ["龙骨配件", "0833"], ["铝合金龙骨", "0835"], ["其它龙骨及配件", "0837"], ["格栅、格片/挂片", "0841"], ["隔断及筒形天棚", "0845"]],

	"门窗制品及门窗五金" : [["木门窗", "0901"], ["钢门窗", "0903"], ["彩钢门窗", "0905"], ["不锈钢门窗", "0907"], ["铝合金门窗", "0909"], ["塑钢、塑料门窗", "0911"], ["铁艺门窗", "0915"], ["全玻及自动门窗", "0917"],
			["纱门、纱窗", "0921"], ["特种门", "0923"], ["卷帘", "0925"], ["其它门窗", "0927"], ["门、窗帘及其配件", "0941"], ["门窗锁类", "0947"], ["门窗五金", "0949"], ["木墙五金配件", "0951"]],

	"装饰线条、装饰件、栏杆、扶手及其它" : [["装饰线条、装饰件、栏杆、扶手及其它", "1000"], ["木质装饰线条", "1001"], ["金属装饰线条", "1003"], ["石材装饰线条", "1005"], ["石膏装饰线条", "1007"], ["塑料装饰线条", "1009"], 
						   ["复合材料装饰线条", "1011"], ["其它装饰线条", "1017"], ["栏杆、栏板", "1021"],["扶手", "1023"], ["壁纸", "1031"], ["贴墙布", "1033"], ["装饰字", "1039"], ["招牌、灯箱", "1041"], ["地毯、挂毯及门毡", "1043"], ["其它装饰材料", "1045"]],

	"涂料及防腐防水材料" : [["建筑涂料", "1101"], ["功能性涂料", "1103"], ["木器涂料", "1105"], ["金属涂料", "1106"], ["道路、桥梁涂料", "1107"], ["工业设备涂料", "1109"], ["通用涂料", "1111"], 
						   ["油料、树脂", "1141"], ["颜料、填料", "1143"], ["涂料辅助材料", "1145"],["耐酸砖、板", "1151"], ["沥青", "1155"], ["防水卷材", "1157"], ["防水油膏、剂、粉、胶类", "1159"], ["止水材料", "1161"], ["其他防腐防水材料", "1171"]],
	
    // part2
	"油品、化工原料及胶粘材料" : [["油品、化工原料及胶粘材料","1200"], ["燃料油","1201"], ["溶剂油、绝缘油","1203"], ["润滑油","1205"], ["润滑脂 、蜡","1207"], ["其它油品","1208"], 
							 ["无机化工原料","1230"], ["有机化工原料","1231"], ["化工剂类","1233"], ["化工填料","1235"], ["工业气体","1237"], ["胶粘剂","1241"], ["胶粘制品","1241"]],

"绝热、耐火材料" : [["绝热、耐火材料","1300"], ["石棉及其制品","1301"], ["岩棉及其制品","1303"], ["矿渣棉及其制品","1305"], ["玻璃棉及其制品","1307"], ["膨胀珍珠岩及其制品","1309"],
			       ["膨胀蛭石及其制品","1311"], ["泡沫橡胶（塑料）及其制品","1312"], ["泡沫玻璃及其制品","1313"], ["硅藻土及其制品","1316"], ["电伴热带/缆","1317"], 
				   ["其它绝热材料","1319"], ["粘土质耐火砖","1331"], ["硅质耐火砖","1333"], ["铝质耐火砖","1335"], ["镁质耐火砖","1339"], ["刚玉砖","1341"], ["其它耐火砖","1343"], 
				   ["耐火泥、砂、石","1351"], ["不定形耐火材料","1353"], ["耐火纤维及其制品","1355"], ["耐火粉、骨料","1357"], ["其他耐火材料","1359"]],

"管材" : [["焊接钢管","1401"], ["镀锌钢管","1403"], ["不锈钢管","1404"], ["无缝钢管","1405"], ["异型钢管","1407"], ["铸铁管","1409"], ["铝管","1411"], ["铜管","1413"], 
		 ["金属软管","1421"], ["金属波纹管","1423"], ["塑料管","1431"], ["异形塑料管","1435"], ["橡胶管","1437"], ["玻璃钢管","1439"], ["玻璃管","1441"], ["陶瓷（土）管","1443"],
		 ["水泥、混凝土管","1445"], ["复合管","1455"], ["其它管材","1457"]],

"管件" : [["管件及管道用器材","1500"], ["可锻铸铁螺纹管件","1501"], ["镀锌管件","1502"], ["铸铁给水、燃气管管件","1503"], ["铸铁排水管管件","1505"], ["钢板卷管管件","1507"],
		 ["不锈钢管管件","1509"], ["铜管件","1511"], ["其它材质管件","1513"], ["管接头","1515"], ["塑料与复合管件","1516"], ["塑料给水、燃气管管件","1521"], ["塑料排水管管件","1523"],
		 ["复合管管件","1525"], ["过滤器","1531"], ["视镜","1535"], ["管卡、管箍","1537"], ["管道支吊架","1539"], ["管道补偿器及软接头","1541"], ["其余管件","1543"]],

"阀门" : [["阀门","1600"], ["截止阀","1601"], ["闸阀","1603"], ["球阀","1605"], ["蝶阀","1607"], ["止回阀","1609"], ["安全阀","1611"], ["调节阀","1613"], ["疏水阀","1617"], 
		 ["旋塞阀","1623"], ["减压阀","1627"], ["电磁阀","1628"], ["水位控制阀","1633"], ["浮球阀","1637"], ["塑料阀门","1638"], ["其它阀门","1641"], ["阀门专用附件","1651"]],

"法兰" : [["法兰","1700"], ["钢制法兰","1701"], ["不锈钢法兰","1703"], ["铸铁法兰","1705"], ["铜法兰","1707"], ["塑料法兰","1709"], ["其它法兰","1711"], ["盲板","1721"], 
		 ["金属垫片","1731"], ["非金属垫片","1733"]],

"洁具" : [["浴缸、浴盘","1801"], ["净身盆、器（妇洗盆）","1803"], ["淋浴器","1805"], ["淋浴间、淋浴屏","1807"], ["洗脸盆、洗手盆","1809"], ["洗涤盆、化验盆","1813"], ["大便器","1815"], 
		 ["小便器","1817"], ["卫生器具用水箱","1825"], ["烘手器","1827"], ["其它卫生洁具","1831"], ["水嘴、水龙头","1841"], ["排水栓、地漏","1843"], ["存水弯、检查口","1845"],
		 ["地面扫除口、下水口","1847"], ["洁具专用阀门","1849"], ["洁具专用开关件","1853"], ["洁具专用配件","1855"], ["消毒器、消毒锅","1861"], ["饮水器","1863"], ["厨用隔油器","1871"],         ["抽水缸","1873"], ["调压装置","1875"], ["燃气管道专用附件","1881"]],

"水暖及通风空调器材" : [["散热器","1900"], ["铸铁散热器","1901"], ["钢制散热器","1903"], ["铜及复合散热器","1907"], ["散热器专用配件","1911"], ["集气罐","1921"], ["集热器","1923"],
					   ["除污器","1925"], ["膨胀水箱","1927"], ["汽水集配器","1931"], ["风机盘管","1940"], ["风口","1941"], ["散流器","1943"], ["风管、风道","1945"], ["风帽","1947"], 
					   ["罩类","1949"], ["风口过滤器、过滤网","1951"], ["调节阀","1953"], ["消声器","1955"], ["静压箱","1959"], ["其它通风空调器材","1961"]],

"消防" : [["消防器材","2000"], ["灭火器","2001"], ["消火栓、消火栓箱","2003"], ["消防水泵接合器","2005"], ["消防箱、柜","2007"], ["泡沫发生器、比例混合器","2011"], ["水流指示器","2013"],	         ["消防水枪","2019"], ["消防喷头","2021"], ["软管卷盘、水龙带及接扣","2023"], ["选择阀","2025"], ["分水器、集水器、滤水器","2027"], ["隔膜式气压水罐","2029"], ["报警器","2037"],																																																																				         ["其它报警器材","2041"], ["其他消防器","2045"]],

"仪表" : [["仪表及自动化控制","2100"], ["水表","2101"], ["燃气表","2103"], ["电度表","2104"], ["电工测量仪表","2107"], ["温度测量仪表、压力仪表","2111"], ["差压、流量仪表","2113"], 
		 ["节流装置","2115"], ["物位检测仪表","2117"], ["显示仪表","2119"], ["物性检测仪表","2125"], ["工业计算机器材","2133"], ["仪表接头、堵头","2159"], ["仪表专用阀门","2163"], 
		 ["取源部件","2165"], ["其它仪表及自控器材","2169"]],

"灯具" : [["灯具、光源","2200"], ["光源","2201"], ["吊灯","2205"], ["吸顶灯","2207"], ["格栅灯（荧光灯盘）","2215"], ["庭院、广场、道路、景观灯","2233"], ["标志、应急灯","2235"], 
		 ["水下灯","2241"], ["厂矿、场馆用灯","2243"], ["灯头、灯座、灯罩","2251"], ["灯架","2252"], ["灯戗、灯伞、灯臂","2253"], ["启辉器、镇流器、触发器","2255"], 
		 ["专业灯具电源","2257"], ["其它灯具及附件","2261"]],
	// part3
	"开关" : [["开关、插座","2300"], ["拉线开关","2301"], ["扳把开关","2303"], ["电子感应开关","2309"], ["调速面板开关","2311"], ["门铃、门铃开关","2315"], ["按钮开关","2321"], ["其它控制开关","2323"], ["面板、边框、盖板","2331"], 
			["电源插座","2341"], ["刮须插座","2343"], ["电源插头","2345"]],

	"保险、绝缘材料" : [["熔断器、熔断丝","2401"], ["保险器材","2403"], ["避雷器材","2405"], ["漏电保护器材","2407"], ["高压绝缘子","2409"], ["低压绝缘子","2411"], ["绝缘穿墙套管、瓷套管","2413"], ["瓷绝缘散材","2415"], ["绝缘布、绝缘带","2417"], 
			["绝缘板、绝缘箔","2419"], ["绝缘棒","2423"], ["其余绝缘材料","2425"]],

	"电线电缆及光纤光缆" : [["电线电缆及光纤光缆","2500"], ["裸电线","2501"], ["电气装备用电线电缆","2503"], ["电力电缆","2511"], ["室内电话电缆","2521"], ["长途通信电缆","2523"], ["光纤光缆","2525"], ["信号电线电缆","2527"], ["计算机用电缆","2531"], 
			["特种电缆","2541"], ["其它电线电缆","2543"]],

	"电气线路敷设材料" : [["电缆桥架","2601"], ["桥架连接件及附件","2602"], ["线槽及其连接件","2603"], ["母线槽","2605"], ["电线、电缆套管及其管件","2606"], ["电缆头","2607"], ["接线端子","2609"], ["接线盒（箱）","2611"], ["母线金具","2613"], 
			["线路金具","2617"], ["电杆、塔","2619"], ["杆塔固定件","2621"], ["杆塔支撑横担及附件","2623"], ["线路连接附件","2625"], ["其他线路敷设材料","2627"]],

	"弱电及信息类器材" : [["安防报警、出入口控制器材","2701"], ["安防检查、监控显示器材","2703"], ["停车场管理系统器材","2705"], ["电话装置及器材","2707"], ["广播线路、移动通信器材","2709"], ["有线电视、卫星电视器材","2711"], 
				  ["信息插座插头器材","2713"], ["计算机网络系统器材","2715"], ["扩声、音乐背景器材","2719"], ["其它弱电及信息类器材","2721"]],

	"仿古建筑材料" : [["琉璃砖","2801"], ["琉璃瓦件","2803"], ["琉璃人、兽材料","2805"], ["琉璃其余仿古材料","2807"], ["粘土砖","2809"], ["粘土瓦件","2811"], ["粘土人、兽材料","2813"], ["仿古油饰、彩画材料","2817"], ["裱糊工程材料","2819"]],

	"园林绿化" : [["乔木","2901"], ["灌木","2903"], ["藤本植物","2905"], ["地被植物","2907"], ["棕榈植物","2909"], ["观赏竹","2911"], ["草本花卉","2913"], ["水生花卉","2915"], ["盆景","2917"], ["假山、观景石","2923"], ["园艺资材","2929"], ["浇水喷头","2931"]],

	"成型构件及加工件" : [["钢结构制作件","3001"], ["铸铁及铁构件","3003"], ["压力容器构件","3007"], ["漏斗","3009"], ["水箱","3011"], ["减震器","3025"], ["木质加工件","3031"], ["机械设备安装用加工件","3033"], ["装置设备附件","3035"], ["其它成型制品","3041"]],

	"密封、电极及劳保用品等其它材料" : [["密封材料","3101"], ["电极材料","3103"], ["火工材料","3105"], ["无损探伤用耗材","3107"], ["纸、笔","3109"], ["劳保用品","3111"], ["零星施工用料","3113"], ["水电汽、煤炭","3115"], ["号牌、铭牌","3117"]],

	"周转材料及工器具" : [["周转材料及工器具","3200"], ["模板","3201"], ["模板附件","3202"], ["脚手架及其配件","3203"], ["围护、运输类周转材料","3205"], ["胎具、模具类周转材料","3207"], ["其余周转材料","3209"], ["手动起重工具","3213"], 
				  ["测量工具","3227"], ["衡器","3229"], ["实验室用工器具","3233"], ["磨具","3237"], ["其它工器具","3239"]],

	"道路桥梁专用材料" : [["道路桥梁专用材料","3300"], ["道路管井、沟、槽等构件","3301"], ["道路桥梁接口材料","3302"], ["土工格栅","3303"], ["路面砖","3305"], ["路面天然石构件","3307"], ["广场砖","3309"], ["隔离装置","3313"], 
				  ["交通（安全）标志","3321"], ["其它交通设施","3335"]],
	
	// part4

	"通风空调设备" : [["通风空调设备","5000"], ["空调器","5003"], ["冷热水机组","5005"],["冷却塔","5007"], ["空气幕","5011"], ["空气加热、冷却器","5013"], ["诱导器","5019"], ["净化过滤设备","5025"], ["其它空调器材","5027"], ["通风机","5029"], 
				["吊风扇、壁扇","5033"], ["排气扇、换气扇","5035"], ["台扇、落地扇","5037"], ["其它通风器材","5041"]],

	"泵、供水设备" : [["泵","5100"], ["离心式水泵","5101"], ["离心式油泵","5103"], ["离心式耐腐蚀泵","5105"], ["离心式杂质泵","5107"], ["漩涡泵","5111"], ["往复泵","5113"], ["泵专用配件"],"5135"],

	"热水、采暖锅炉设备" : [["热水、蒸汽锅炉","5200"], ["热水器、开水炉","5201"], ["沸水器","5203"], ["冷热水混合器","5205"], ["热交换器","5207"], ["采暖炉","5209"], ["其它水暖设备","5213"], ["其它锅炉设备","5229"]],

	"水处理及环保设备" : [["水软化设备","5305"], ["过滤设备","5311"], ["曝气设备","5315"], ["毛发聚集器","5330"], ["除尘设备","5337"]],

	"厨房设备" : [["灶具","5429"]],

	"电气设备及附件" : [["电气屏类","5503"], ["电气柜类","5505"], ["箱式变电站","5507"], ["配电箱","5509"], ["配电开关","5513"], ["断路器","5515"], ["互感器","5517"], ["调压器、稳压器","5519"], ["电抗器、电容器","5521"], ["接触器","5523"], ["起动器","5525"],
				 ["电气控制器","5527"], ["继电器","5529"], ["电阻器、分流器","5531"], ["电磁器件","5533"], ["蓄电池及附件","5541"], ["变压器","5543"], ["发电机","5547"], ["其它电气设备","5549"]],

	"电梯" : [["乘客电梯","5601"], ["电梯机械配件","5631"], ["电梯电气装置","5633"]],

	"安防及建筑智能化设备" : [["入侵报警设备","5701"], ["出入口控制设备","5703"], ["安全检查设备","5705"], ["电视监控设备","5707"], ["终端显示设备","5709"], ["其余安防设备","5715"], ["楼宇多表远传系统","5721"], ["楼宇自控系统","5723"],
					["门禁系统","5725"], ["停车场管理系统","5727"], ["综合布线系统","5729"], ["计算机网络设备","5731"], ["有线电视系统","5733"], ["扩声、背景音乐系统","5735"], ["微波无线接入设备","5737"], ["会议电话设备","5739"], 
					["视频会议设备","5741"], ["同声传译设备器材","5743"]],

	"砼、砂浆及其它配合比材料" : [["水泥砂浆","8001"], ["石灰砂浆","8003"], ["混合砂浆","8005"], ["特种砂浆","8007"], ["其它砂浆","8009"], ["灰浆、水泥浆","8011"], ["石子浆","8013"], ["胶泥、脂、油","8015"], ["水泥混凝土","8021"], ["轻质水泥混凝土","8023"], 
					  ["沥青混凝土","8025"], ["特种混凝土","8027"], ["灰土垫层","8031"], ["多合土垫层","8033"], ["其它垫层材料","8035"]],

	"工程检测仪器仪表" : [["工程测绘仪器","9801"], ["电源","9803"], ["电工测量仪表","9805"], ["信号发生器","9807"], ["功率计、场强仪","9809"], ["元器件测试仪","9811"], ["频率、时间测试仪","9813"], ["光电测试仪","9815"], ["通信测试仪表","9817"], 
				  ["衰减器","9819"], ["电平表、振荡器","9821"], ["示波器、扫频仪","9823"], ["测振仪、频谱仪","9825"], ["声振测量仪","9826"], ["噪声、杂音仪表、辐射计","9827"], ["相位计、抖晃仪","9831"], ["信号、逻辑分析仪","9832"], 
				  ["雷达测试仪","9833"], ["电缆测试仪表","9835"], ["计算机仪表","9837"], ["电视仪表","9839"], ["电力仪表","9841"], ["自动化仪表","9843"], ["石油专用仪表","9845"], ["其它工程仪器仪表","9847"]],

	"工程费用台班" : [["挖掘机械","9901"], ["桩工、钻孔机械","9903"], ["混凝土及灰浆用机械","9905"], ["铲土及水平运输机械","9907"], ["起重及垂直运输机械","9909"], ["压实及路面机械","9913"], ["清洗筛选及装修机械","9915"], 
				["钢筋和预应力机械","9917"], ["加工机械","9919"], ["木工机械","9921"], ["切割及打磨机械","9923"], ["焊接机械","9925"], ["冷却及热处理机械","9927"], ["无损探伤机械","9929"], ["环卫机械" ,"9931"],["破碎及凿岩机械","9933"], 
				["钻探及地下工程机械","9935"], ["园林和高空作业机械","9937"], ["电气线路机械","9939"], ["潜水及水面作业机械","9941"], ["动力机械","9943"], ["其它工程机械","9945"]]

};
//得到所有分类
//ext-store-data用到(不包括所有) 数据格式['value','text']
function getAllStuff_cid(){
	var array = [];
	for(var c in stuff_cid){
		array.push(['/' + c + '/', " ├ " + c]);
		for(var z = 0; z < stuff_cid[c].length; z++){
			array.push(['/' + c + '/' + stuff_cid[c][z][0] + '/', " │  ├ " + stuff_cid[c][z][0]]);
		}
	}
	return array;
};
//得到一级分类
//ext-store-data用到(包括所有) 数据格式['value','text']
function getAllStuff_cid_1(){
	var array = [];
	array.push(['', '所有']);
	if (stuff_cid != null) {
		for (var bp in stuff_cid) {
			array.push([bp, bp]);
		}
	}
	return array;
};
//ext-store-data用到(包括所有) 数据格式['value','text']
//得到二级分类
function getAllStuff_cid_2(el){
	var array = [];
	array.push(['', '所有']);
	if(el!=undefined&&el!=""){
		for(var i = 0; i < stuff_cid[el].length; i++){
			array.push([stuff_cid[el][i][0], stuff_cid[el][i][0]]);
		}
	}
	return array;
};
//ext-store-data用到(不包括所有) 数据格式['value','text']
//得到一级分类
function getStuff_cid_1(){
	var array = [];
	if (stuff_cid != null) {
		for (var bp in stuff_cid) {
			array.push([bp, bp]);
		}
	}
	return array;
};
//ext-store-data用到(不包括所有) 数据格式['value','text']
//得到二级分类
function getStuff_cid_2(el){
	var array = [];
	if(el!=undefined&&el!=""){
		for(var i = 0; i < stuff_cid[el].length; i++){
			array.push([stuff_cid[el][i][0], stuff_cid[el][i][0]]);
		}
	}
	return array;
};