/*
 * 供求分类 
 * 所有标点符号请使用英文半角输入,各一级分类以逗号分隔，最后一个分类后不加任何符号 例如："黑色及有色金属":["xx","xx"],"水暖及通风空调器材":["xx","xx"]
 * 
 * "黑色及有色金属":["xx","xx"]与"水暖及通风空调器材":["xx","xx"]之间 和 "xx","xx"之间必须加逗号
 */
 
 var stuff_gongqiu={
 	"黑色及有色金属" : ["钢筋", "钢材", "扁钢", "工字钢", "槽钢", "型钢", "钢板", "铜板", "铝材",
			"铝合金", "其它金属"],
	
	"橡胶、塑料及非金属" : ["橡胶", "塑料", "有机玻璃", "石墨", "玻璃钢", "其它非金属"],
	
 	"五金制品" : ["钉", "螺栓", "螺母", "螺柱", "焊接", "轴承", "铁丝", "铁件", "锚具", "其它五金"],
	
 	"水泥、砖瓦灰砂石及混凝土制品" : ["水泥", "砂", "石", "砌体", "瓦", "混凝土", "添加剂"],	

 	"木、竹材及其制品" : ["原木", "锯材", "胶合板", "竹材", "其它竹木木制品"],	

 	"玻璃、陶瓷及面砖" : ["玻璃", "平板玻璃", "彩色玻璃", "钢化玻璃", "夹丝玻璃", "夹层玻璃", "中空玻璃", "镀膜玻璃", "工艺装饰玻璃",
			"镭射玻璃", "特种玻璃", "玻璃砖", "玻璃制品", "陶瓷砖", "陶瓷制品"],

 	"装饰石材及地板" : ["天然石", "人造石", "微晶玻璃板", "水磨石", "文化石", "其它石材", "石材制品", "木地板", "竹地板",
			"塑料地板", "橡胶地板", "复合地板", "活动地板", "其它地板"],

 	"墙面、天棚装饰及屋面材料" : ["石膏装饰板", "竹木装饰板", "金属装饰板", "矿物棉装饰板", "塑料装饰板", "复合装饰板", "铝塑复合板", "纤维水泥装饰板", "珍珠岩装饰板",
			"硅酸钙装饰板", "轻质复合板", "轻钢龙骨", "铝合金龙骨", "其它龙骨", "其它装饰材"],

 	"门窗制品及门窗五金" : ["木门窗", "金属门窗", "塑钢、塑料门窗", "全玻及自动门窗", "特种门", "卷帘", "其它门窗", "门窗配件", "门窗锁类",
			"门窗五金", "其它门窗制品", "复合地板", "活动地板", "其它地板"],	

 	"装饰线条、装饰件、栏杆、扶手及其它" : ["装饰线条", "栏杆", "扶手", "壁纸", "地毯", "其它装饰材料"],	

 	"涂料及防腐防水材料" : ["涂料", "油料树脂", "颜料填料", "沥青", "防水卷材", "防水油膏、剂、粉、胶类", "其他防腐防水材料"],	

	"油品、化工原料及胶粘材料" : ["油品", "无机化工原料", "有机化工原料", "胶粘制品"],	

	"绝热、耐火材料" : ["绝热材料", "耐火砖", "耐火泥、砂、石", "耐火纤维", "其他耐火材料"],	

 	"管材" : ["焊接钢管", "镀锌钢管", "不锈钢管", "无缝钢管", "异型钢管", "铸铁管", "铝管", "铜管", "金属软管", "金属波纹管", "塑料管", "橡胶管",
			"玻璃钢管", "玻璃管", "陶瓷管", "水泥、混凝土管", "复合管", "其它管材"],

 	"管件" : ["镀锌管件", "铸铁管件", "钢板卷管管件", "不锈钢管管件", "铜管件", "塑料管管件", "燃气管管件", "塑料排水管管件", "复合管管件", "其余管件"],	

 	"阀门" : ["截止阀", "闸阀", "球阀", "止回阀", "安全阀", "调节阀", "疏水阀", "旋塞阀", "减压阀", "电磁阀", "水位控制阀", "浮球阀", "塑料阀门", "其它阀门"],	

	"法兰" : ["钢制法兰", "不锈钢法兰", "铸铁法兰", "铜法兰", "塑料法兰", "其它法兰"],	

 	"洁具" : ["浴缸", "淋浴器", "洗脸盆", "大便器", "小便器", "烘手器", "水龙头", "排水栓", "存水弯", "消毒器、消毒锅", "饮水器", "其它卫生洁具"],

 	"水暖及通风空调器材" : ["散热器", "集气罐", "集热器", "除污器", "膨胀水箱", "汽水集配器", "风机盘管", "风口", "散流器", "风管、风道", "风帽", 
				   "罩类", "风口过滤器、过滤网", "消声器", "静压箱", "其它通风空调器材"],

 	"消防" : ["灭火器", "消火栓", "消防箱", "泡沫发生器", "水流指示器", "消防水枪", "消防喷头", "软管卷盘、水龙带及接扣", "分水器、集水器、滤水器",
			"隔膜式气压水罐", "报警器"],

 	"仪表" : ["水表", "燃气表", "电度表", "电工测量仪表", "温度测量仪表", "压力仪表", "差压、流量仪表", "节流装置", "物位检测仪表", 
			"显示仪表", "物性检测仪表", "工业计算机器材", "其它仪表及自控器材"],

	"灯具" : ["光源", "吊灯", "吸顶灯", "格栅灯", "庭院、广场、道路、景观灯", "标志、应急灯", "水下灯", "厂矿、场馆用灯", "其它灯具及附件"],	

	"开关" : ["开关", "面板", "插座"],	

	"保险、绝缘材料" : ["保险器材", "避雷器材", "漏电保护器材", "绝缘材料"],	

 	"电线电缆及光纤光缆" : ["电线", "电气电缆", "电力电缆", "电话电缆", "通信电缆", "光纤光缆", "信号电线电缆", "计算机用电缆", "特种电缆", "其它电线电缆"],

 	"电气线路敷设材料" : ["电缆桥架", "桥架连接件", "线槽", "母线槽", "电线、电缆套管", "电杆、塔", "杆塔固定件", "杆塔支撑横担", "其他线路敷设材料"],

 	"弱电及信息类器材" : ["安防报警、出入口控制器材", "安防检查、监控显示器材", "停车场管理系统器材", "电话装置及器材", "广播线路、移动通信器材", 
				  "有线电视、卫星电视器材", "信息插座插头器材", "计算机网络系统器材", "扩声、音乐背景器材", "其它弱电及信息类器材"],

 	"仿古建筑材料" : ["琉璃砖", "琉璃瓦件", "琉璃人、兽材料", "琉璃其余仿古材料", "粘土砖", "粘土瓦件", "粘土人、兽材料", "仿古油饰、彩画材料", "裱糊工程材料"],

 	"园林绿化" : ["乔木", "灌木", "藤本植物", "地被植物", "棕榈植物", "观赏竹", "草本花卉", "水生花卉", "盆景", "假山、观景石", "园艺资材", "浇水喷头"],

 	"成型构件及加工件" : ["钢结构制作件", "铸铁及铁构件", "压力容器构件", "漏斗", "水箱", "减震器", "木质加工件", "机械设备安装用加工件", "装置设备附件", "其它成型制品"],

 	"密封、电极及劳保用品等其它材料" : ["密封材料", "电极材料", "火工材料", "劳保用品", "其它材料"],

 	"周转材料及工器具" : ["模板", "脚手架", "围护、运输类周转材料", "胎具、模具类周转材料", "其余周转材料", "起重工具", "测量工具", "其它工器具"],

 	"道路桥梁专用材料" : ["道路管井、沟、槽等构件", "道路桥梁接口材料", "土工格栅", "路面砖", "路面天然石构件", "广场砖", "隔离装置", "交通标志", "其它交通设施"],

 	"通风空调设备" : ["通风空调设备", "空调器", "冷热水机组", "冷却塔", "空气幕", "空气加热、冷却器", "诱导器", "净化过滤设备", "其它空调器材", 
				"通风机", "吊风扇、壁扇", "排气扇、换气扇", "台扇、落地扇", "其它通风器材"],

 	"泵、供水设备" : ["泵", "离心式水泵", "离心式油泵", "离心式耐腐蚀泵", "离心式杂质泵", "漩涡泵", "往复泵", "泵专用配件"],

 	"热水、采暖锅炉设备" : ["热水、蒸汽锅炉", "热水器、开水炉", "沸水器", "冷热水混合器", "热交换器", "采暖炉", "其它水暖设备", "其它锅炉设备"],

 	"水处理及环保设备" : ["水软化设备", "过滤设备", "曝气设备", "毛发聚集器", "除尘设备"],

 	"厨房设备" : ["灶具"],

 	"电气设备及附件" : ["电气屏", "电气柜", "箱式变电站", "配电箱", "配电开关", "断路器", "互感器", "调压器、稳压器", "电抗器、电容器", "接触器",
				 "起动器", "电气控制器", "继电器", "电阻器、分流器", "电磁器件", "蓄电池", "变压器", "发电机", "其它电气设备"],

 	"电梯" : ["乘客电梯", "电梯机械配件", "电梯电气装置"],

 	"安防及建筑智能化设备" : ["入侵报警设备", "出入口控制设备", "安全检查设备", "电视监控设备", "终端显示设备", "楼宇多表远传系统", "楼宇自控系统", 
					"门禁系统", "停车场管理系统", "综合布线系统", "计算机网络设备", "有线电视系统", "扩声、背景音乐系统", "微波无线接入设备", "会议电话设备", 
					"视频会议设备", "同声传译设备器材", "其它安防智能化设备"],
					
	"体育休闲设施" : ["田径设施","室内球馆设施","室外球场设施","游泳馆设施","水上游乐设施","健身设施","保龄球设施","滑雪溜冰设施","攀岩运动设施","其他体育休闲设施"],
	
 	"砼、砂浆及其它配合比材料" : ["砂浆", "胶泥、脂、油", "混凝土", "垫层"],

 	"工程检测仪器仪表" : ["工程测绘仪器", "电源", "电工测量仪表", "信号发生器", "功率计、场强仪", "元器件测试仪", "频率、时间测试仪", "光电测试仪", 
				  "通信测试仪表", "衰减器", "电平表、振荡器", "示波器、扫频仪", "测振仪、频谱仪", "声振测量仪", "噪声、杂音仪表、辐射计", "相位计、抖晃仪", 
				  "信号、逻辑分析仪", "雷达测试仪", "电缆测试仪表", "计算机仪表", "电视仪表", "电力仪表", "自动化仪表", "石油专用仪表", "其它工程仪器仪表"],

 	"工程费用台班" : ["挖掘机械", "桩工、钻孔机械", "混凝土及灰浆用机械", "铲土及水平运输机械", "起重及垂直运输机械", "压实及路面机械", "清洗筛选及装修机械", 
					"钢筋和预应力机械", "加工机械", "木工机械", "切割及打磨机械", "焊接机械", "冷却及热处理机械", "无损探伤机械", "环卫机械", 
					"破碎及凿岩机械", "钻探及地下工程机械", "园林和高空作业机械", "电气线路机械", "潜水及水面作业机械", "动力机械", "其它工程机械"],

 	"劳动力" : ["劳动力"]

 };
 //得到所有供求分类
 ///ext-store-data用到(不包括所有) 数据格式['value','text']
 function getAllStuff_gongqiu(){
 	var array = [];
	for(var c in stuff_gongqiu){
		array.push(['/' + c + '/', " ├ " + c]);
		for(var z = 0; z < stuff_gongqiu[c].length; z++){
			array.push(['/' + c + '/' + stuff_gongqiu[c][z] + '/', " │  ├ " + stuff_gongqiu[c][z]]);
		}
	}
	return array;
 };
 //得到供求一级分类
 //ext-store-data用到(包括所有) 数据格式['value','text']
 function getAllStuff_gongqiu_1(){
 	var array = [];
	array.push(['', '所有']);
	for (var bp in stuff_gongqiu) {
		array.push([bp, bp]);
	}
	return array;
 };
 //得到供求二级分类
 //ext-store-data用到(包括所有) 数据格式['value','text']
 function  getAllStuff_gongqiu_2(el){
 	var array = [];
	array.push(['', '所有']);
	if(el!=undefined&&el!=""){
		for(var i = 0; i < stuff_gongqiu[el].length; i++){
			array.push([stuff_gongqiu[el][i], stuff_gongqiu[el][i]]);
		}
	}
	return array;
 };
 
 //得到供求一级分类
 //ext-store-data用到(不包括所有) 数据格式['value','text']
 function getStuff_gongqiu_1(){
 	var array = [];
	for (var bp in stuff_gongqiu) {
		array.push([bp, bp]);
	}
	return array;
 };
 //得到供求二级分类
 //ext-store-data用到(不包括所有) 数据格式['value','text']
 function  getStuff_gongqiu_2(el){
 	var array = [];
	if(el!=undefined&&el!=""){
		for(var i = 0; i < stuff_gongqiu[el].length; i++){
			array.push([stuff_gongqiu[el][i], stuff_gongqiu[el][i]]);
		}
	}
	return array;
 };